china-djyos/djyos/bsp/cpudrv/stm32/L4/src/iic/cpu_peri_iic.c
                }
            }
            //传输是结束
            if((reg->ISR&I2C_ISR_TC)||(reg->ISR&I2C_ISR_STOPF))//传输完成
            {
                __IIC_GenerateStop(reg);
                return true;
            }
        }
        return false;

    }
    //写字节小于255字节
    else
    {
        reg->CR2 &=~I2C_CR2_RELOAD;//小于255字节
        reg->CR2 &=~I2C_CR2_NBYTES_8BIT(0xff);//清零
        reg->CR2 |=I2C_CR2_NBYTES_8BIT(len);
        reg->CR2 |=I2C_CR2_AUTOEND;//自动结束方式
        reg->CR2 |=I2C_CR2_START;//start
        while(timeout<CONFIG_I2C_MBB_TIMEOUT)
        {

            if((reg->ISR&I2C_ISR_TXE)&&(reg->ISR&I2C_ISR_TXIS)\
                  &&(!(reg->ISR&I2C_ISR_NACKF)))//传输字节
            {

                if(i<addr_len)
                     reg->TXDR = adder_nuf[i];
                else
                    reg->TXDR= buf[i-addr_len];
                i++;
            }

            else//判断出错或者超时
            {
                if(_IIC_Chek(reg)==false)
                    return false;
                timeout++;
                DJY_DelayUs(10);
            }
            //判断是否传输完成
            if((reg->ISR&I2C_ISR_TC)||(reg->ISR&I2C_ISR_STOPF))//传输完成
            {
                if(reg->ISR|I2C_ISR_STOPF)
                    return true;
                if(_IIC_Chek(reg)==false)
                    return false;
                return true;
            }
        }
        return false;
    }
}
// =============================================================================
// 功能：IIC写地址
// 参数： reg,寄存器基址
//        devaddr,器件物理地址，最后一bit区分读写
//         mem_addr写缓冲
//       maddrlen 长度
//        Start_falg发送起始停止标着为
// 返回：true/false
// =============================================================================
static bool_t __IIC_WriteAddr(tagI2CReg *reg,u8 devaddr, u8 *mem_addr, u32 maddrlen)
{
    u32 timeout=0;
    u32 i=0;
    reg->CR2 &=~I2C_CR2_SADD_10BIT(0x7f<<1);
    reg->CR2 |=I2C_CR2_SADD_10BIT(devaddr<<1);//从器件地址
    reg->CR2 &=~I2C_CR2_RD_WRN;//写控制
     if(reg->ISR|=I2C_ISR_STOPF)
            reg->ICR|=I2C_ICR_STOPCF;
     if(reg->ISR|=I2C_ISR_NACKF)
            reg->ICR|=I2C_ICR_NACKCF;

    reg->CR2 &=~I2C_CR2_RELOAD;//小于255字节
    reg->CR2 &=~I2C_CR2_NBYTES_8BIT(0xff);//清零
    reg->CR2 |=I2C_CR2_NBYTES_8BIT(maddrlen);
    reg->CR2 |=I2C_CR2_AUTOEND;//自动结束方式
    reg->CR2 |=I2C_CR2_START;//start
    while(timeout<CONFIG_I2C_MBB_TIMEOUT)
    {

        if((reg->ISR&I2C_ISR_TXE)&&(reg->ISR&I2C_ISR_TXIS)\
                &&(!(reg->ISR&I2C_ISR_NACKF)))//传输字节
        {
            *((volatile u8 *)&reg->TXDR)=mem_addr[i++];
        }
        else//判断出错或者超时
        {
            if(_IIC_Chek(reg)==false)
                return false;
            timeout++;
            DJY_DelayUs(10);
        }
        //判断是否传输完成
        if((reg->ISR&I2C_ISR_TC)||(reg->ISR&I2C_ISR_STOPF))//传输完成
        {
//                __IIC_GenerateStop(reg);
                return(_IIC_Chek(reg));
        }
    }
    return false;

}

// =============================================================================
// 功能：IIC读
// 参数： reg,寄存器基址
//        devaddr 器件地址
//         buf收缓冲区
//       len 长度
// 返回：true/false
// =============================================================================
static bool_t __IIC_Read(tagI2CReg *reg,u8 devaddr,u8 *buf, u32 len)
{
    u32 timeout=0,i=0;
    u32 timedef;
    reg->CR2 &=~I2C_CR2_SADD_10BIT(0x7f<<1);
    reg->CR2 |=I2C_CR2_SADD_10BIT(devaddr<<1);//从器件地址
    reg->CR2 |=I2C_CR2_RD_WRN;//读控制位
    timedef=CONFIG_I2C_TIMEOUT*len;
    if(reg->ISR|=I2C_ISR_STOPF)//清除停止位
        reg->ICR|=I2C_ICR_STOPCF;
    if(reg->ISR|=I2C_ISR_NACKF)
            reg->ICR|=I2C_ICR_NACKCF;
    if(len>255)
    {
        reg->CR2 |=I2C_CR2_RELOAD;//大于255字节
        reg->CR2 |=I2C_CR2_NBYTES_8BIT(0xff);
        reg->CR2 |=I2C_CR2_AUTOEND;//自动结束方式
        reg->CR2 |=I2C_CR2_START;//start

        while((timeout<timedef))
        {
            if(reg->ISR&I2C_ISR_RXNE)//传输字节
            {
                buf[i++]=reg->RXDR;
            }
            else//判断出错或者超时
            {
                if(_IIC_Chek(reg)==false)
                    return false;
                timeout++;
                DJY_DelayUs(10);
            }

            if(reg->ISR&I2C_ISR_TCR)//255字节传输完成
            {
                len-=255;
                if(len>255)
                {
                    reg->CR2 |=I2C_CR2_NBYTES_8BIT(0xFF);
                    reg->CR2 |=I2C_CR2_RELOAD;//传输字节大于255
                }
                else
                {
                    reg->CR2 &=~I2C_CR2_NBYTES_8BIT(0xff);//清零
                    reg->CR2 |=I2C_CR2_NBYTES_8BIT(len);
                    reg->CR2 &=~I2C_CR2_RELOAD;//传输字节
//                    reg->CR2 |=I2C_CR2_AUTOEND;//自读发送停止位

                }
            }
            //传输是结束
            if((!(reg->ISR&I2C_ISR_RXNE))&&    //最后一位读取完成
            ((reg->ISR&I2C_ISR_TC)))
            {
                __IIC_GenerateStop(reg);
                return true;
            }
        }
        return false;
    }
    //读小于255字节
    else
    {
        reg->CR2 &=~I2C_CR2_RELOAD;//小于255字节
        reg->CR2 &=~I2C_CR2_NBYTES_8BIT(0xff);//清零
        reg->CR2 |=I2C_CR2_NBYTES_8BIT(len);
        reg->CR2 |=I2C_CR2_AUTOEND;//自动结束方式
        reg->CR2 |=I2C_CR2_START;//start


        while((timeout<timedef))
        {
            if(reg->ISR&I2C_ISR_RXNE)//传输字节
            {
                buf[i++]=reg->RXDR;
            }
            else
            {
                if(_IIC_Chek(reg)==false)
                    return false;
                timeout++;
                DJY_DelayUs(10);
            }
            //判断是否传输完成传输完成或者已经产生停止位
            if((!(reg->ISR&I2C_ISR_RXNE))&&    //最后一位读取完成
            (reg->ISR&I2C_ISR_TC))//(reg->ISR&I2C_ISR_STOPF)
            {
                __IIC_GenerateStop(reg);//非自动方式需要手动调用
                return true;
            }
        }
        return false;
    }

}

// =============================================================================
// 功能：轮询方式读IIC从设备的数据
// 参数：reg,寄存器基址
//       devaddr,器件物理地址，最后一bit区分读写
//         memaddr//寄存器地址
//         maddrlen的寄存器地址的长度
//       addr,访问的寄存器地址
//       buf, 存储缓冲区
//       len, 存储缓冲区的长度
// 返回：len,读取成功;-1,读取失败
// =============================================================================
static s32 __IIC_ReadPoll(tagI2CReg *reg,u8 devaddr,u32 memaddr,
                        u8 maddrlen, u8 *buf, u32 len)
{

    u8 mem_addr_buf[4];
    //将地址作大小端变换
    u8 i;
    for(i=0;i<maddrlen;i++)
    {
        mem_addr_buf[(maddrlen-1)-i]=((memaddr>>(8*i))&0xff);
    }
    // 发送写器件地址和内部寄存器地址
    if(false == __IIC_WriteAddr(reg, devaddr, mem_addr_buf, maddrlen))
        return -1;

