china-djyos/djyos/bsp/cpudrv/stm32/L4/src/iic/cpu_peri_iic.c
    if(false == __IIC_Read(reg, devaddr, buf,len))
        return -1;
    __IIC_GenerateStop(reg);//非自动方式需要手动调用
    return len;
}

// =============================================================================
// 功能：轮询方式向IIC从设备的写数据
// 参数：reg,寄存器基址
//       devaddr,设备地址
//       memaddr,设备内部地址
//       maddrlen,设备内部地址长度
//       buf,存储数据
//       len,数据长度，字节
// 返回：len,读取成功;-1,读取失败
// =============================================================================
static s32 __IIC_WritePoll(tagI2CReg *reg,u8 devaddr,u32 memaddr,
                        u8 maddrlen, u8 *buf, u32 len)
{
    u8 mem_addr_buf[4];
    u8 i;
    for(i=0;i<maddrlen;i++)
    {
        mem_addr_buf[(maddrlen-1)-i]=((memaddr>>(8*i))&0xff);
    }

    if( __IIC_Write(reg, devaddr, mem_addr_buf, maddrlen,buf,len)==false)//写存储器地址
       return -1;

    return len;

}

// =============================================================================
// 功能：轮询方式读写IIC设备
// 参数：reg,寄存器基址
//       DevAddr,设备地址
//       MemAddr,设备内部地址
//       MemAddrLen,设备内部地址长度
//       Buf,存储数据
//       Length,数据长度，字节
//       WrRdFlag,读写标记，为0时写，1时为读
// 返回：
// =============================================================================
static bool_t __IIC_WriteReadPoll(tagI2CReg *reg,u8 DevAddr,u32 MemAddr,\
                                u8 MemAddrLen,u8* Buf, u32 Length,u8 WrRdFlag)
{
    static bool_t flag;

    __IIC_IntDisable(reg);
    reg->CR1 |= I2C_CR1_PE;//PE使能
    if(WrRdFlag == CN_IIC_WRITE_FLAG)   //写
    {
        if(Length == __IIC_WritePoll(reg,DevAddr,MemAddr,MemAddrLen,Buf,Length))
            flag = true;
        else
            flag = false;
    }
    else                                //读
    {
        if(Length == __IIC_ReadPoll(reg,DevAddr,MemAddr,MemAddrLen,Buf,Length))
            flag = true;
        else
            flag = false;
    }
    reg->CR1 &=~I2C_CR1_PE;//PE失能

    return  flag ;
}

// =============================================================================
// 功能: 启动写时序，启动写时序的过程为：器件地址（写）、存储地址（写），当存储地址完
//       成时，需打开中断，之后将会发生发送中断，在中断服务
//       函数中，每次发送一定的字节数，直到len数据量，post信号量iic_bus_semp，并产生
//       停止时序
// 参数: SpecificFlag,个性标记，本模块内即IIC寄存器基址
//      DevAddr,器件地址的前7比特，已将内部地址所占的bit位更新，该函数需将该地址左
//               移一位增加增加最后一位读/写比特;
//      MemAddr,存储器内部地址，即发送到总线上的地址，该地址未包含放在器件地址上的
//               比特位；
//      MenAddrLen,存储器内部地址的长度，字节单位，未包含在器件地址里面的比特位；
//      Length,接收的数据总量，接收数据的倒数第一字节，即count-1，停止产生ACK信号，
//          当接收的字节数为count时，产生停止时序，并释放信号量iic_semp;
//      IIC_BusSemp,发送完成时驱动需释放的信号量。发送程序读IIC_PortRead时，若读不到数
//          则需释放该信号量，产生结束时序
// 返回: TRUE，启动读时序成功，FALSE失败
// =============================================================================
static bool_t __IIC_GenerateWriteStart(tagI2CReg *reg,
                                       u8 dev_addr,
                                       u32 mem_addr,
                                       u8 maddr_len,
                                       u32 length,
                                       struct SemaphoreLCB *iic_semp)
{
    u8 mem_addr_buf[4];
    u8 iic_port;
    //通过specific_flag区分是哪条总线
    if(reg==tg_I2c_Reg[CN_IIC1])
        iic_port=CN_IIC1;
    else if (reg==tg_I2c_Reg[CN_IIC2])
        iic_port=CN_IIC2;
    else if (reg==tg_I2c_Reg[CN_IIC3])
        iic_port=CN_IIC3;
    else
        return false;

    IntParamset[iic_port].TransTotalLen = length;
    IntParamset[iic_port].TransCount = 0;
    IntParamset[iic_port].pDrvPostSemp = iic_semp;           //iic_bus_semp

    //将地址作大小端变换

    u8 i;
    for(i=0;i<maddr_len;i++)
    {
        mem_addr_buf[(maddr_len-1)-i]=((mem_addr>>(8*i))&0xff);
    }
    __IIC_IntDisable(reg);                 //关中断
    //先发送器件地址，内部地址，然后发送第一个数据
    if(__IIC_WriteAddr(reg, dev_addr, mem_addr_buf,maddr_len) )
    {
        reg->CR2 &=~I2C_CR2_RD_WRN;//写标志
        reg->CR2 |=I2C_CR2_RELOAD;//传输字节大于255
        reg->CR2 |=I2C_CR2_NBYTES_8BIT(0xFF);
        reg->CR2 |=I2C_CR2_AUTOEND;//自动结束方式
        __IIC_IntEnable(reg);//使能中断
        reg->CR2 |=I2C_CR2_START;//start
        return true;
    }

    return false;
}

// =============================================================================
// 功能: 启动读时序，启动读时序的过程为：器件地址（写）、存储地址（写）、器件地址（读）
//       当器件地址（读）完成时，需打开中断，重新配置寄存器为接收模式，之后将会发生
//       接收数据中断，在中断中将接收到的数据调用IIC_PortWrite写入缓冲，接收到len字
//       节数的数据后，释放信号量iic_semp
// 参数: SpecificFlag,个性标记，本模块内即IIC寄存器基址
//      DevAddr,器件地址的前7比特，已将内部地址所占的bit位更新，该函数需将该地址左
//               移一位增加增加最后一位读/写比特;
//     MemAddr,存储器内部地址，即发送到总线上的地址，该地址未包含放在器件地址上的
//               比特位；
//      MenAddrLen,存储器内部地址的长度，字节单位，未包含在器件地址里面的比特位；
//      Length,接收的数据总量，接收数据的倒数第一字节，即count-1，停止产生ACK信号，当接
//             收的字节数为count时，产生停止时序，并释放信号量iic_semp;
//     IIC_BusSemp,读完成时，驱动需释放的信号量（缓冲区信号量）
// 返回: TRUE，启动读时序成功，FALSE失败
// =============================================================================
static bool_t __IIC_GenerateReadStart( tagI2CReg *reg,
                                       u8 dev_addr,
                                       u32 mem_addr,
                                       u8 maddr_len,
                                       u32 length,
                                       struct SemaphoreLCB *iic_semp)
{
    u8 mem_addr_buf[4];
    u8 iic_port;
    if(reg==tg_I2c_Reg[CN_IIC1])
        iic_port=CN_IIC1;
    else if(reg==tg_I2c_Reg[CN_IIC2])
        iic_port=CN_IIC2;
    else if(reg==tg_I2c_Reg[CN_IIC3])
        iic_port=CN_IIC3;
    else
        return false;

    IntParamset[iic_port].TransTotalLen = length;
    IntParamset[iic_port].TransCount = 0;
    IntParamset[iic_port].pDrvPostSemp = iic_semp;               //iic_buf_semp

    u8 i;
    for(i=0;i<maddr_len;i++)
    {
        mem_addr_buf[(maddr_len-1)-i]=((mem_addr>>(8*i))&0xff);
    }
    __IIC_IntDisable(reg);//关中断

    //写器件地址和寻址地址
    //写器件地址和寻址地址
    if(__IIC_WriteAddr(reg, dev_addr, mem_addr_buf,maddr_len) )
    {
        reg->CR2 |=I2C_CR2_AUTOEND;//自动结束方式
        reg->CR2 |=I2C_CR2_RD_WRN;//读标志
        __IIC_IntEnable(reg);//使能中断
        reg->CR2 |=I2C_CR2_START;//start
        return true;
    }
    return false;
}

