china-djyos/djyos/bsp/cpudrv/stm32/L4/src/iic/cpu_peri_iic.c
// =============================================================================
// 功能: 结束本次读写回调函数，区分读写的不同停止时序，当属于发送时，则直接停止时序，
//      若为读，则先停止回复ACK，再停止
// 参数: reg,个性标记，本模块内即IIC寄存器基址
// 返回: 无
// =============================================================================
static void __IIC_GenerateEnd(tagI2CReg *reg)
{
    if(reg == NULL)
        return;
    if(reg->CR2 & I2C_CR2_RD_WRN )//发送
    {
        reg->CR1 |= I2C_CR2_NACK;//停止回复ACK
        __IIC_GenerateStop(reg);
    }
    else //接收
    {
        __IIC_GenerateStop(reg);
    }
}

//==============================================================================
// 功能：IIC总线控制回调函数，被上层调用，目前只实现对IIC时钟频率配置
// 参数：TIMINGR-->位 31:28 PRESC时序预分频因子
//                   位 23:20 SCLDEL[3:0]：数据建立时间
//                   位 19:16 SDADEL[3:0]：数据保持时间
//                   位 15:8 SCLH[7:0]：SCL 高电平周期
//                   位 7:0 SCLL[7:0]：SCL 低电平周期
//   reg    本模块内即IIC寄存器基址
// 返回：无
//==============================================================================
static void _IIC_ClkSet(tagI2CReg *reg,u32 data)
{
    u32 SCLH,SCLL;
    reg->CR1 &=~I2C_CR1_PE;
    SCLH=(CN_CFG_MCLK)/(data*2);
    SCLL=SCLH;
    reg->TIMINGR&=~((I2C_TIMINGE_SCLH_8BIT(0xff)|I2C_TIMINGE_SCLL_8BIT(0xff)));
    reg->TIMINGR|=(I2C_TIMINGE_SCLH_8BIT(SCLH)|I2C_TIMINGE_SCLL_8BIT(SCLL));
    reg->CR1 |=I2C_CR1_PE;//PE使能
}

// =============================================================================
// 功能：IIC总线控制回调函数，被上层调用，目前只实现对IIC时钟频率配置
// 参数：reg,个性标记，本模块内即IIC寄存器基址
//       cmd,命令
//       data1,data2,数据，与具体命令相关
// 返回：无
// =============================================================================
static s32 __IIC_BusCtrl(tagI2CReg *reg,u32 cmd,u32 data1,u32 data2)
{
    if( reg == NULL )
        return 0;
    switch(cmd)
    {
        case CN_IIC_SET_CLK: //设置时钟频率
                _IIC_ClkSet(reg,data1);
              break;
        case CN_IIC_DMA_USED://使用dma传输

            break;
        case CN_IIC_DMA_UNUSED://禁止dma传输

            break;
        case CN_IIC_SET_POLL:           //使用轮询方式发送接收
            __IIC_IntDisable(reg);
            break;
        default:
            return 0;
    }
    return 1;
}

// =============================================================================
// 功能：        IIC接收与发送中断服务函数。该函数实现的功能如下：
//       1.每发送与接收一个或若干字节发生一次中断；
//       2.若有多个中断使用同一个中断号，则需根据具体情况区分使用的是哪个中断；
//       3.清中断标志，并判断ACK信号，每读写字节，计数器都需相应修改；
//       4.接收达到倒数第一个字节时，需配置不发送ACK信号；
//       5.接收或发送完成时，需post信号量IntParam->pDrvPostSemp；
//       6.接收或发送完成时，需产生停止时序。
// 参数：i2c_int_line,中断号，本函数没用到
// 返回：true falst
// =============================================================================
static u32 __IIC_ISR(ufast_t i2c_int_line)
{
    static struct IIC_CB *ICB;
    static struct IIC_IntParamSet *IntParam;
    tagI2CReg *reg;
    u8 iic_port;
    u8 ch;
    u32 IicErrorNo;
    switch (i2c_int_line)
    {
        case CN_INT_LINE_I2C1_EV:
            iic_port=CN_IIC1;
            break;
        case CN_INT_LINE_I2C2_EV:
            iic_port=CN_IIC2;
            break;
        case CN_INT_LINE_I2C3_EV:
            iic_port=CN_IIC3;
            break;
        default:    return false;
    }
    reg = (tagI2CReg*)tg_I2c_Reg[iic_port];
    ICB = s_ptIIC_CB[iic_port];
    IntParam = &IntParamset[iic_port];

    //判断中断方式
    //清除中断
    //发送或者接受数据
    //出错检查
    if(reg->ISR & I2C_ISR_TXIS) //发送中断
    {
        if(IIC_PortRead(ICB,&ch,1) > 0)
        {
            *((volatile u8 *)&reg->TXDR) = ch;
            IntParam->TransCount ++;;
        }
        else if(IntParam->TransCount == IntParam->TransTotalLen)
        {
          Lock_SempPost(IntParam->pDrvPostSemp);
          __IIC_IntDisable(reg);//关中断
          __IIC_GenerateStop(reg);
        }
    }
    else if(reg->ISR & I2C_ISR_RXNE)//接收中断
    {
        while((IntParam->TransCount < IntParam->TransTotalLen))
        {
            // 最后一个字节master不发ACK，表示读操作终止
            if(IntParam->TransCount == IntParam->TransTotalLen - 1)
            {
                reg->CR2 |= I2C_CR2_NACK;
            }

            while (reg->ISR&I2C_ISR_RXNE)//传输字节
                ch = reg->RXDR;
            //写数据
            IIC_PortWrite(ICB,&ch,1);
            IntParam->TransCount ++;
        }
        if((IntParam->TransCount == IntParam->TransTotalLen)  &&
                                    (!(reg->ISR&I2C_ISR_RXNE)))//最后一位读取完成
        {
            __IIC_GenerateStop(reg);
            __IIC_IntDisable(reg);//关中断
            Lock_SempPost(IntParam->pDrvPostSemp);//释放总线信号量
        }

    }

    else//未启动通信
    {
        if(reg->ISR & (I2C_ISR_ARLO))//仲裁丢失中断
        {
            reg->ICR = I2C_ICR_ARLOCF;//清除仲裁丢失中断标志位
            IicErrorNo = CN_IIC_POP_MAL_LOST_ERR;
            IIC_ErrPop(ICB,IicErrorNo);
        }
        if(reg->ISR & (I2C_ISR_NACKF))
        {
            reg->ICR = I2C_ICR_ARLOCF;//清除仲裁丢失中断标志位
            IicErrorNo = CN_IIC_POP_NO_ACK_ERR;
            IIC_ErrPop(ICB,IicErrorNo);
        }
    }

    return true;
}

// =============================================================================
// 功能：IIC底层驱动的初始化，完成整个IIC总线的初始化，其主要工作如下：
//       1.初始化总线控制块IIC_CB，回调函数和缓冲区的初始化赋值；
//       2.默认的硬件初始化，如GPIO或IIC寄存器等；
//       3.中断初始化，完成读写中断配置；
//       4.调用IICBusAdd或IICBusAdd_r增加总线结点；
// 参数：iic_port  IIC编号 CN_IIC1
//       Add_mode 寻址模式
// 返回：无
// =============================================================================
bool_t ModuleInstall_IIC(u8 iic_port)
{

    struct IIC_Param IIC_Config[CN_IIC_NUM];

    IIC_Config[iic_port].BusName             = (char *)IIC_Name[iic_port];
    IIC_Config[iic_port].IICBuf              = (u8*)s_IICBuf[iic_port];
    IIC_Config[iic_port].IICBufLen           = IIC_BUF_LEN[iic_port];
    IIC_Config[iic_port].SpecificFlag        = (ptu32_t)tg_I2c_Reg[iic_port];
    IIC_Config[iic_port].pGenerateWriteStart = (WriteStartFunc)__IIC_GenerateWriteStart;
    IIC_Config[iic_port].pGenerateReadStart  = (ReadStartFunc)__IIC_GenerateReadStart;
    IIC_Config[iic_port].pGenerateEnd        = (GenerateEndFunc)__IIC_GenerateEnd;
    IIC_Config[iic_port].pBusCtrl            = (IICBusCtrlFunc)__IIC_BusCtrl;
    IIC_Config[iic_port].pWriteReadPoll      = (WriteReadPoll)__IIC_WriteReadPoll;

    __IIC_HardConfig(iic_port);
    __IIC_IntConfig(iic_port,__IIC_ISR);

    s_ptIIC_CB[iic_port] = IIC_BusAdd(&IIC_Config[iic_port]);
    if(s_ptIIC_CB[iic_port])
        return 0;
    else
        return 1;
}
